In [22]:
# EXTRA ---- We perform one-hot encoding to convert categorical values 
#            to numeric ones so that can be fed to the ML algorithm

In [3]:
import pandas as pd

In [5]:
import requests
from requests.auth import HTTPBasicAuth
import json

In [8]:
# pd.read_csv()

# pd.to_csv() --> used to export DataFrame to a CSV file

# pd.to_json() --> used to convert DF to a JSON string === NaN and None values are converted to 'null' in JSON

# pd.json_normalize() --> flattens JSON data to (tabular format) pd DataFrame

In [20]:
    data = [
        {'id': 1, 'name': 'Alice', 'details': {'city': 'NY', 'age': 30}}, 
        {'id': 2, 'name': 'Bob', 'details': {'city': 'LA', 'age': 25} }
           ]


normalized_df = pd.json_normalize(data, meta = ['id', 'name'])

# normalized_df = pd.json_normalize(data, record_path=['details'], meta=['id', 'name'])


#  the 'record_path' to indicate the path to the records within the JSON 
# and 'meta' to include additional fields as metadata
normalized_df

   id   name details.city  details.age
0   1  Alice           NY           30
1   2    Bob           LA           25

In [12]:
type(data)

list

In [14]:
type(normalized_df) # !!!!!!!!!!!!!!!!!!!!!!!!!!!!

pandas.core.frame.DataFrame

In [37]:
normalized_df

   id   name details.city  details.age
0   1  Alice           NY           30
1   2    Bob           LA           25

In [39]:
type(normalized_df)

pandas.core.frame.DataFrame

In [42]:
data = {'col1': [1, 2], 'col2': ['A', 'B']}
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [44]:
json_string = df.to_json(orient='split')
type(json_string)

str

In [47]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [1, 7, 8], 'B': [4, 8, 26]})

differences = df1.compare(df2) 
# gives the differences bw 2 dF but their shape must be same
# element-wise differences
# returns a new dF

print(differences)

     A          B
  self other self other
1  2.0   7.0  5.0   8.0
2  3.0   8.0  6.0  26.0

In [49]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})

indicator = df1.equals(df2) # ---> returns a boolean value.... not really much use though

indicator

True

In [51]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [1, 7, 3], 'B': [4, 8, 6]})

diff = df1 == df2

diff

       A      B
0   True   True
1  False  False
2   True   True

In [53]:
type(diff)

pandas.core.frame.DataFrame

In [56]:
json_string = '{"name": "Alice", "age": 30, "city": "New York"}'
type(json_string)

str

In [58]:
data = json.loads(json_string) # ----> converts the JSON string to a python dict
data

{'name': 'Alice', 'age': 30, 'city': 'New York'}

In [60]:
type(data)

dict

In [62]:
data.get('city') # ---> returns None by default

'New York'

In [64]:
# .get(key, default) --> returns your own choiced 'Default'
data.get("race", "cartoon")

'cartoon'

In [67]:
# Header {"Accept" : "application/json" } — What we expect to receive

# You use it to tell the server what format you want the response in

# we use it with "get" request only because we want some message body

In [69]:
# Header {"Content-Type" : "application/json"} - What you are sending

# we use this only when we’re sending a body (e.g., POST, PUT, PATCH)

In [72]:

data = [['John', 50, 'Austin', 70],
        ['Cataline', 45 , 'San Francisco', 80],
        ['Matt', 30, 'Boston' , 95]]

columns = ['Name', 'Age', 'City', 'Marks']

#row indexes
idx = ['x', 'y', 'z']

df = pd.DataFrame(data, columns=columns, index=idx)

df

       Name  Age           City  Marks
x      John   50         Austin     70
y  Cataline   45  San Francisco     80
z      Matt   30         Boston     95

In [74]:
new_idx = ['a', 'y', 'z']

new_df = df.reindex(new_idx)

new_df

       Name   Age           City  Marks
a       NaN   NaN            NaN    NaN
y  Cataline  45.0  San Francisco   80.0
z      Matt  30.0         Boston   95.0

In [76]:
# If values for these new indexes were not present in the original DataFrame, 
# the function fills those positions with the default nulls. 
# However, we can alter the default value NaN to whatever value we want them to fill with

In [79]:
data = [['John', 50, 'Male', 'Austin', 70],
        ['Cataline', 45 ,'Female', 'San Francisco', 80],
        ['Matt', 30 ,'Male','Boston', 95]]

# Column labels of the DataFrame
columns = ['Name','Age','Sex', 'City', 'Marks']

In [81]:
df = pd.DataFrame(data, columns=columns)

df

       Name  Age     Sex           City  Marks
0      John   50    Male         Austin     70
1  Cataline   45  Female  San Francisco     80
2      Matt   30    Male         Boston     95

In [83]:
dude = df["Sex"].value_counts()

dude

Sex
Male      2
Female    1
Name: count, dtype: int64

In [85]:
# Series.value_counts() returns the count of each unique value of a series or a column

In [ ]:
# usecols to reduce the number of columns to read into the dF

df = pd.read_csv("meraCSV.csv", usecols = ['name', 'email', 'bodycount'])

In [ ]:
# use chunksize for splitting the data into chunks

for chunks in pd.read_csv("meraCSV.csv", usecols = ['name', 'email', 'bodycount'], chunksize = 5000):
    chunks['email_domain'] = chunks['email'].str.split('@').str[-1]

chnks

In [93]:
# Sample DataFrame
import numpy as np


df = pd.DataFrame({
    "id": np.arange(1000000),
    "score": np.random.rand(1000000) * 100,
    "gender": np.random.choice(["Male", "Female"], size=1000000)
})

In [95]:
df

            id      score  gender
0            0  14.021229  Female
1            1  17.228779  Female
2            2  48.120906  Female
3            3  29.852310    Male
4            4  61.944513  Female
...        ...        ...     ...
999995  999995  90.353179    Male
999996  999996  56.456903  Female
999997  999997  36.649709  Female
999998  999998   4.071106    Male
999999  999999  61.117229  Female

[1000000 rows x 3 columns]

In [99]:
df.to_numpy() # returns a NumPy representation of the data

array([[0, 14.021229075408648, 'Female'],
       [1, 17.22877888066917, 'Female'],
       [2, 48.12090616251552, 'Female'],
       ...,
       [999997, 36.64970894886186, 'Female'],
       [999998, 4.071106302943073, 'Male'],
       [999999, 61.11722886745149, 'Female']], dtype=object)

In [ ]:
# NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column. 
# while converting, numpy makes all the dtypes into object so it can fit all the other dtypes of dF

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   id      1000000 non-null  int32
 1   score   1000000 non-null  float64
 2   gender  1000000 non-null  object
dtypes: float64(1), int32(1), object(1)
memory usage: 19.1+ MB

In [103]:
df["id"] = pd.to_numeric(df["id"], downcast = 'integer')

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   id      1000000 non-null  int32
 1   score   1000000 non-null  float64
 2   gender  1000000 non-null  object
dtypes: float64(1), int32(1), object(1)
memory usage: 19.1+ MB

In [108]:
df['score'] = pd.to_numeric(df['score'], downcast = "float")

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   id      1000000 non-null  int32
 1   score   1000000 non-null  float32
 2   gender  1000000 non-null  object
dtypes: float32(1), int32(1), object(1)
memory usage: 15.3+ MB

In [187]:
df

            id      score  gender
0            0  31.133619  Female
1            1  31.197474  Female
2            2  18.142946    Male
3            3  41.217533    Male
4            4  28.952848  Female
...        ...        ...     ...
999995  999995  27.620758  Female
999996  999996  15.848026    Male
999997  999997  94.048187  Female
999998  999998  69.918808  Female
999999  999999  73.231216  Female

[1000000 rows x 3 columns]

In [112]:
df["gender"] = df["gender"].astype("category")

In [114]:
df

            id      score  gender
0            0  14.021229  Female
1            1  17.228779  Female
2            2  48.120907  Female
3            3  29.852310    Male
4            4  61.944515  Female
...        ...        ...     ...
999995  999995  90.353180    Male
999996  999996  56.456902  Female
999997  999997  36.649708  Female
999998  999998   4.071106    Male
999999  999999  61.117229  Female

[1000000 rows x 3 columns]

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   id      1000000 non-null  int32
 1   score   1000000 non-null  float32
 2   gender  1000000 non-null  category
dtypes: category(1), float32(1), int32(1)
memory usage: 8.6 MB

In [119]:
df1 = pd.DataFrame(  {'id':  [1,  2, 3] }, index= [1, 2, 3] )
df1

   id
1   1
2   2
3   3

In [121]:
df2 = pd.DataFrame({'score': [90, 80, 70]}, index=[1, 2, 3])
df2

   score
1     90
2     80
3     70

In [123]:
df2.join(df1)

   score  id
1     90   1
2     80   2
3     70   3

In [125]:
df1.join(df2)

   id  score
1   1     90
2   2     80
3   3     70

In [128]:
# Left DataFrame
df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

# Right DataFrame
df2 = pd.DataFrame({
    'id': [2, 3, 4],
    'score': [88, 92, 75]
})

In [130]:
df1.merge(df2, on="id", how="outer")

   id     name  score
0   1    Alice    NaN
1   2      Bob   88.0
2   3  Charlie   92.0
3   4      NaN   75.0

In [132]:
df3 = pd.DataFrame({
    'user_id': [2, 3], 
    'score': [88, 92]
})


df1.merge(df3, left_on="id", right_on="user_id")

   id     name  user_id  score
0   2      Bob        2     88
1   3  Charlie        3     92

In [134]:
df1.set_index('id').merge(df2.set_index('id'), left_index = True, right_on = "id")

       name  score
id
2       Bob     88
3   Charlie     92

In [136]:
lol = df1.set_index('id').merge(df3.set_index('user_id'), left_index = True, right_index = True, sort = True)

lol

      name  score
2      Bob     88
3  Charlie     92

In [138]:
df1 = pd.DataFrame({
    'id': [1, 2, 3, 40],
    'name': ['Alice', 'Bob', 'Charlie', 'ME'],
    'sex' : ['Male', 'Female', 'Male', "in-bw"]
})

df4 = pd.DataFrame({
    'id': [21, 3],
    'name': ['Zack', 'Emma'],
     'sex' : ['Female', 'Male'],
    'player': ['google', 'apple'],
    'type' : ['Elite', "premium"]
   
})

In [140]:
df4.merge(df1, on = "id", suffixes = ('_left', '_right' ), how="outer", indicator = True)

   id name_left sex_left  player     type name_right sex_right      _merge
0   1       NaN      NaN     NaN      NaN      Alice      Male  right_only
1   2       NaN      NaN     NaN      NaN        Bob    Female  right_only
2   3      Emma     Male   apple  premium    Charlie      Male        both
3  21      Zack   Female  google    Elite        NaN       NaN   left_only
4  40       NaN      NaN     NaN      NaN         ME     in-bw  right_only

In [143]:
start = pd.Timestamp("2023-06-01 08:00:00")
end = pd.Timestamp("2023-06-03 14:45:00")

start

Timestamp('2023-06-01 08:00:00')

In [145]:
delta = end - start

print(delta)

2 days 06:45:00

In [147]:
type(delta)

pandas._libs.tslibs.timedeltas.Timedelta

In [151]:
timestamp = pd.Timestamp("2023-06-01 08:00:00")

delta = pd.Timedelta(hours=3, days=3)

new_time = timestamp + delta

new_time

Timestamp('2023-06-04 11:00:00')

In [153]:
# concat() is like stacking blocks (rows or columns).

df1 = pd.DataFrame({'id': [1, 2], 'name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'id': [3], 'name': ['Charlie']})

print(df1)

df2

# Type of operation = Stacking (vertical or horizontal)

   id   name
0   1  Alice
1   2    Bob

   id     name
0   3  Charlie

In [155]:
df_concat = pd.concat([df1, df2], axis = 1, ignore_index = True)

In [157]:
df_concat # stacking rows/col

   0      1    2        3
0  1  Alice  3.0  Charlie
1  2    Bob  NaN      NaN

In [160]:
import pandas as pd

# Create a DataFrame
data = {
    'Name': ['John', 'Matt', 'John', 'Cateline'],
    'math_Marks': [18, 20, 19, 15],
    'science_Marks': [10, 20, 15, 12]
}

# Create a DataFrame df
df = pd.DataFrame(data)
df

       Name  math_Marks  science_Marks
0      John          18             10
1      Matt          20             20
2      John          19             15
3  Cateline          15             12

In [162]:

df['total'] = df.apply(lambda row : row["math_Marks"] + row["science_Marks"], axis=1)

df

       Name  math_Marks  science_Marks  total
0      John          18             10     28
1      Matt          20             20     40
2      John          19             15     34
3  Cateline          15             12     27

In [165]:
# GROUPBY is a functionn

# df.groupby().agg()

In [167]:
data = {
    'Name': ['John', 'Matt', 'John', 'Matt', 'Matt', 'Matt'],
    'Marks': [10, 20, 30, 15, 25, 18]
}

df = pd.DataFrame(data)

df

   Name  Marks
0  John     10
1  Matt     20
2  John     30
3  Matt     15
4  Matt     25
5  Matt     18

In [169]:
df.groupby('Name').sum()

      Marks
Name
John     40
Matt     78

In [171]:
df.groupby("Name").agg(['sum', 'max', 'min'])

     Marks
       sum max min
Name
John    40  30  10
Matt    78  25  15

In [173]:
df = pd.DataFrame({
    'Name': ['John', 'John', 'Matt', 'Matt'],
    'Subject': ['Math', 'Science', 'Math', 'Science'],
    'Marks': [85, 90, 75, 80]
})

df

   Name  Subject  Marks
0  John     Math     85
1  John  Science     90
2  Matt     Math     75
3  Matt  Science     80

In [175]:
df.groupby(['Name', 'Subject']).mean()

              Marks
Name Subject
John Math      85.0
     Science   90.0
Matt Math      75.0
     Science   80.0

In [177]:
grouped = df.groupby("Name")["Marks"].mean().reset_index()

grouped

   Name  Marks
0  John   87.5
1  Matt   77.5